app/controllers/attendances_controller.rb

  def create
    if already_participate?
      flash[:danger] = "Il n'est pas possible de s'inscrire plusieurs fois a un evenement"
      redirect_to event_path(@event)
    else
      @event.attendances.create(user_id: current_user.id)
---
INSERT INTO "attendances" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 11], ["event_id", 2], ["created_at", "2020-05-12 20:27:21.050249"], ["updated_at", "2020-05-12 20:27:21.050249"]]

  def destroy
    find_attendance
    if @attendance.destroy
---
DELETE FROM "attendances" WHERE "attendances"."id" = $1  [["id", 11]]

  def find_attendance
    @attendance = Attendance.where(user_id: current_user.id, event_id: params[:event_id]).first
---
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1 AND "attendances"."event_id" = $2 ORDER BY "attendances"."id" ASC LIMIT $3  [["user_id", 11], ["event_id", 2], ["LIMIT", 1]]

    def find_event
      @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def already_participate?
      Attendance.where(user_id: current_user.id, event_id: params[:event_id]).exists?
---
SELECT  1 AS one FROM "attendances" WHERE "attendances"."user_id" = $1 AND "attendances"."event_id" = $2 LIMIT $3  [["user_id", 11], ["event_id", 2], ["LIMIT", 1]]