app/controllers/events_controller.rb

INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    @event.admin = current_user

      if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_event
      begin
        @event = Event.find(params[:id])