app/controllers/users_controller.rb

  def show
    @events_admin = Event.where(admin: @user)
---
SELECT "events".* FROM "events" WHERE "events"."admin_id" = $1  [["admin_id", 11]]

    def set_user
      begin
       @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

    def my_page
      unless current_user == User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]