app/models/attendance.rb

    def self.users(event)
        @participants = Array.new
        @users = Attendance.where(event_id: event.id)
        @users.each do |user|
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 2]]